package ex6;
/*
Дз к 08.11 автоматизировать следующие сценарии: Сценарий №1
1. Перейти по ссылке - https://www.raiffeisen.ru/
2. Выбрать пункт меню – Сервисы
3. Выбрать – Перевод по карте/телефону
4. Проверить, что на открывшейся странице есть текст - Перевод с карты на карту / по номеру телефона
5. Заполнить поля:
Карта отправителя - 5406 5715 1819 4617
Карта получателя - 5367433138590699
Срок действия
CVC – 512
Сумма – 5
6 Проверить, что появилось сообщение - Минимальная сумма перевода – 10 р

Сценарий №2
1. Перейти по ссылке - https://www.raiffeisen.ru/
2. Нажать кнопку – Выбор региона
3. Выбрать – Владимир
4. Проверить, что на главной странице регион Москва сменилась на Владимир
5. Поскроллить к концу страницы
6. Проверить, что в конце страницы есть ссылки
– Качество обслуживания, Карьера в банке, Реквизиты, Противодействие коррупции*/

public class Homework {


}
