/*
    Дз к 29.10 -
            1. Добавить в программу вычисления площади и периметра фигур обработку исключений, предусмотреть, что сторона фигуры не может быть отрицательной.
            2. Реализовать тесты, которые будут проверять, что в программе предусмотрены необходимые исключения. Проверить Сообщения об ошибках.
            3. Реализовать параметризованные тесты для одного из методов.
4. Для тестов , которые проверяют периметр и площадь прямоугольника, реализовать TestRule, который будет создавать объект прямоугольник перед каждым тестом, значения сторон равны случайным числам.
5. Создать новую ветку проекта, переписать тесты для обработки исключений и параметризованные тесты, используя JUnit5.*/
package ex2;
public class Main {

    public static void main(String[] args) {


    }
}

